from src.functions.discord import find_channel_by_name


def ege_24_text_1() -> tuple[str, str, int]:
    title_msg = 'Видео-курс 24 Задание ЕГЭ Информатика'

    description_msg = 'Хочешь понять строки и уметь решать все 24ые номера?\n'
    description_msg += 'Тогда это то, что тебе нужно!\n\n'
    description_msg += 'Что входит в курс:\n'
    description_msg += '• Основы строк\n'
    description_msg += '• Срезы\n'
    description_msg += '• Словари и крутые фичи\n'
    description_msg += '• Разбор 25+ заданий(всё что только может попасться)\n'
    description_msg += '• Курс постоянно обновляется и дополняется\n'
    description_msg += '  + задания с последних лет из реальных ЕГЭ\n\n'
    description_msg += 'Общая длительность курса: более 3ёх часов.\n\n'
    description_msg += 'Источники задач:\n'
    description_msg += '1) Реальные задания с ЕГЭ\n'
    description_msg += '2) КПоляков\n'
    description_msg += '3) Мои тренировочные задания\n\n'
    description_msg += 'Самая основная теория + большое количество практических разборов и советов от меня.\n\n'
    description_msg += '💻Как это проходит:\n'
    description_msg += 'Курс располагается на платформе Stepik.\n'
    description_msg += 'Есть возможность написания кода, получения по нему фидбека, просмотра готового решения и объяснений + задания вопросов.\n'
    color_msg = 0x5ACFF5

    return (title_msg, description_msg, color_msg)


def ege_24_text_2(owner) -> str:
    text = 'Для приобретения курса перейди по ссылке -> https://stepik.org/143500'

    return text


def ege_25_text_1() -> tuple[str, str, int]:
    title_msg = 'Видео-курс 25 Задание ЕГЭ Информатика'

    description_msg = 'Всё самое необходимое для решения 25ого номера в ЕГЭ.\n\n'
    description_msg += 'Что входит в курс:\n'
    description_msg += '• Нахождение делителей\n'
    description_msg += '• Оптимизация\n'
    description_msg += '• Разбор множества заданий(всё что только может попасться)\n'
    description_msg += '• Курс постоянно обновляется и дополняется\n'
    description_msg += '  + задания с последних лет из реальных ЕГЭ\n\n'
    description_msg += 'Общая длительность курса: 2.5 часа.\n\n'
    description_msg += 'Источники задач:\n'
    description_msg += '1) Реальные задания с ЕГЭ\n'
    description_msg += '2) КПоляков\n'
    description_msg += '3) Мои тренировочные задания\n\n'
    description_msg += 'Самая основная теория + большое количество практических разборов и советов от меня.\n\n'
    description_msg += '💻Как это проходит:\n'
    description_msg += 'Это закрытый видеокурс, находящийся на YouTube.'
    color_msg = 0x5ACFF5

    return (title_msg, description_msg, color_msg)


def ege_25_text_2(owner) -> str:
    text = 'Чтобы получить доступ к Курсу нужно:\n'
    text += '1. Перевести на карту сбербанка 360р. с текстом сообщения: "Инфа25"\n'
    text += 'на карту: 4276 0800 1585 5878\n'
    text += '2. Сделать скрин успешного перевода или скрин на последние 4 цифры карты\n'
    text += '3. Email на YouTube, чтобы был доступ :)\n\n'
    text += f'Скрин и эмэйл отправь мне ({owner.mention}) в личные сообщения'

    return text


def ege_26_text_1() -> tuple[str, str, int]:
    title_msg = 'Видео-курс 26 Задание ЕГЭ Информатика'

    description_msg = 'Всё самое необходимое для решения 26ого номера в ЕГЭ.\n\n'
    description_msg += 'Что входит в курс:\n'
    description_msg += '• Объяснение логики заданий всех типов\n'
    description_msg += '• Решение кодом и через Excel (большинство кодом)\n'
    description_msg += '• Разбор множества заданий(всё что только может попасться)\n'
    description_msg += '  + задания с последних лет из реальных ЕГЭ\n\n'
    description_msg += 'Общая длительность курса: ~2 часа.\n\n'
    description_msg += 'Источники задач:\n'
    description_msg += '1) Реальные задания с ЕГЭ\n'
    description_msg += '2) КПоляков\n'
    description_msg += '3) Мои тренировочные задания\n\n'
    description_msg += 'Самая основная теория + большое количество практических разборов и советов от меня.\n\n'
    description_msg += '💻Как это проходит:\n'
    description_msg += 'Это закрытый видеокурс, находящийся на YouTube.'
    color_msg = 0x5ACFF5

    return (title_msg, description_msg, color_msg)


def ege_26_text_2(owner) -> str:
    text = 'Чтобы получить доступ к Курсу нужно:\n'
    text += '1. Перевести на карту сбербанка 572р. с текстом сообщения: "Инфа26"\n'
    text += 'на карту: 4276 0800 1585 5878\n'
    text += '2. Сделать скрин успешного перевода или скрин на последние 4 цифры карты\n'
    text += '3. Email на YouTube, чтобы был доступ :)\n\n'
    text += f'Скрин и эмэйл отправь мне ({owner.mention}) в личные сообщения'

    return text


def ege_27_text_1() -> tuple[str, str, int]:
    title_msg = 'Видео-курс 27 Задание ЕГЭ Информатика'

    description_msg = 'Всё самое необходимое по строкам для решения 27ого номера в ЕГЭ.\n\n'
    description_msg += 'Что входит в курс:\n'
    description_msg += '• Нахождение делителей\n'
    description_msg += '• Последовательности\n'
    description_msg += '• Динамическое программирование\n'
    description_msg += '• Разбор множества заданий(всё что только может попасться)\n'
    description_msg += '  + задания с последних лет из реальных ЕГЭ\n\n'
    description_msg += 'Общая длительность курса: ~2 часа.\n\n'
    description_msg += 'Источники задач:\n'
    description_msg += '1) Реальные задания с ЕГЭ\n'
    description_msg += '2) КПоляков\n'
    description_msg += '3) Мои тренировочные задания\n\n'
    description_msg += 'Самая основная теория + большое количество практических разборов и советов от меня.\n\n'
    description_msg += '💻Как это проходит:\n'
    description_msg += 'Это закрытый видеокурс, находящийся на YouTube.'
    color_msg = 0x5ACFF5

    return (title_msg, description_msg, color_msg)


def ege_27_text_2(owner) -> str:
    text = 'Чтобы получить доступ к Курсу нужно:\n'
    text += '1. Перевести на карту сбербанка 750р. с текстом сообщения: "Инфа26"\n'
    text += 'на карту: 4276 0800 1585 5878\n'
    text += '2. Сделать скрин успешного перевода или скрин на последние 4 цифры карты\n'
    text += '3. Email на YouTube, чтобы был доступ :)\n\n'
    text += f'Скрин и эмэйл отправь мне ({owner.mention}) в личные сообщения'

    return text


def krugosvetka_pro_text_1() -> tuple[str, str, int]:
    title_msg = 'Мастер-группа Кругосветка PRO ЕГЭ Информатика'

    description_msg = 'Хочешь высокие баллы? Тогда это то, что тебе нужно!\n'
    description_msg += '80+, 90+ или 100 баллов станут реальностью 😉\n\n'
    description_msg += 'Кругосветка — это отличная возможность подготовиться к ЕГЭ!\n'
    description_msg += 'Совместно с ребятами, которые как и ты заинтересованы в успешной \n'
    description_msg += 'подготовке к экзамену, в приятной и комфортной атмосфере время \n'
    description_msg += 'пролетит быстро и ты получишь огромнейший ап скилла и уверенность в себе!\n\n'
    description_msg += 'Что входит в курс:\n\n'
    description_msg += '• 2 занятия в неделю. Все занятия записываются и у тебя \n'
    description_msg += '  будет возможность пересмотреть их в любой момент.\n'
    description_msg += '  Длительность занятий ~90 минут.\n'
    description_msg += '• много практики. Много задач на занятии, много задач\n'
    description_msg += '  после занятия, которые идут тебе в дз.\n'
    description_msg += '• Регулярные пробники для наглядности твоего прогресса \n'
    description_msg += '  и обретении уверенности в своих силах.\n'
    description_msg += '• общий чат со мной и всеми ребятами. А это постоянная мотивация,\n'
    description_msg += '  обсуждение задач, помощь друг другу и немного фана позволит тебе\n'
    description_msg += '  всегда оставаться в тонусе.\n'
    description_msg += '• возможность личного общения со мной, чтобы справиться с волнениями,\n'
    description_msg += '  нервами, трудностями и всем остальным ;)\n'
    description_msg += '• бонусные занятия, созвоны для дополнительной практики и ответов на вопросы.\n'
    description_msg += '• индивидуальная помощь при выборе ВУЗа и направлений.\n\n'
    description_msg += '💻Как это проходит:\n'
    description_msg += 'Все занятия проходят на YouTube в виде закрытых стримов\n'
    description_msg += 'с использованием онлайн-доски (для хранения всех записей)\n\n'

    color_msg = 0x5ACFF5

    return (title_msg, description_msg, color_msg)


def krugosvetka_pro_text_2(owner) -> str:
    text = 'Чтобы получить доступ к Мастер-группе нужно:\n'
    text += '1. Перевести на карту сбербанка 2164р.  с текстом сообщения: "КругосветкаPRO"\n'
    text += 'номер карты: 4276 0800 1585 5878\n'
    text += '2. Сделать скрин успешного перевода или скрин на последние 4 цифры карты\n'
    text += '3. Email на YouTube, чтобы был доступ :)\n'
    text += '4. Скинь мне свой ник в Discord, чтобы я дал роль на сервере\n\n'
    text += f'Скрин и эмэйл отправь мне ({owner.mention}) в личные сообщения'

    return text


def c_university_text_1() -> tuple[str, str, int]:
    title_msg = 'Видео-курс Си для ВУЗа'

    description_msg = 'Хочешь шарить в ВУЗе?\n'
    description_msg += 'Данный видео-курс погрузит тебя в основы этого языка.'
    description_msg += 'Поможет разобраться со всем лабораторными и курсовыми работами и '
    description_msg += 'с продвинутыми темами, которые тоже будут. Нас ждёт большая '
    description_msg += 'практическая работа и совсем немного теории, чтобы в голове '
    description_msg += 'это всё было правильно уложено :)'
    description_msg += 'Что входит в курс:\n\n'
    description_msg += '• Основы языка: \n'
    description_msg += '  основые операторы, условные операторы, '
    description_msg += 'циклы, функции, массивы и строки (символы).\n'
    description_msg += '• Продвинутые темы: \n'
    description_msg += '  очереди, стеки, односвязные и двусвязные списки, '
    description_msg += 'работа с файлами, деревья, кучи, матрицы, '
    description_msg += 'структуры и всё что может попасться в ВУЗе.\n'
    description_msg += '• Огромное количество практических заданий и ГЛАВНОЕ '
    description_msg += 'огромное количество РЕАЛЬНЫХ лабораторных работ с ВУЗов, '
    description_msg += 'практика в которых поможет тебе и разобраться в языке и получить '
    description_msg += 'высокие оценки + всегда быть готов к следующей теме, которую будете проходить. '
    description_msg += 'То есть ты всегда будешь знать, что тебя ждёт и будешь к этому готов ;)\n'
    description_msg += '• Возможность всегда задать вопрос по курсу и получить на него ответ.\n'
    description_msg += '  Сможешь всегда узнать как лучше заниматься, какую лучше выстроить roadmap '
    description_msg += 'и познакомишься с полезными людьми, с которыми сможешь делать общие проекты '
    description_msg += 'или просто общаться для удовольствия :)'
    description_msg += '💻Как это проходит:\n'
    description_msg += 'Все занятия проходят на YouTube в виде закрытых стримов\n'
    description_msg += 'с использованием онлайн-доски (для хранения всех записей)\n\n'

    color_msg = 0x5ACFF5

    return (title_msg, description_msg, color_msg)


def c_university_text_2(owner) -> str:
    text = 'Чтобы получить доступ к Видео-курсу нужно:\n'
    text += '1. Перевести на карту сбербанка 948р.  с текстом сообщения: "СИ для ВУЗа"\n'
    text += 'номер карты: 4276 0800 1585 5878\n'
    text += '2. Сделать скрин успешного перевода или скрин на последние 4 цифры карты\n'
    text += '3. Email на YouTube, чтобы был доступ :)\n'
    text += '4. Скинь мне свой ник в Discord, чтобы я дал роль на сервере\n\n'
    text += f'Скрин и эмэйл отправь мне ({owner.mention}) в личные сообщения'

    return text


def trainer_2_text() -> tuple[str, str, int]:
    title_msg = 'Курс-тренажёр по 2ому заданию ЕГЭ Информатика'

    description_msg = 'Бесплатный курс по подготовке и тренировке 2ого задания из ЕГЭ.\n\n'
    description_msg += '• Научу с 0 делать этот номер;\n'
    description_msg += '• 50+ заданий для практики;\n'
    description_msg += '• Задания из реальных ЕГЭ прошлых лет;\n'
    description_msg += '• Видео-разборы заданий;\n'
    description_msg += '• Ответы на все возникающие вопросы;\n\n'
    description_msg += 'Для прохождения курса перейди по ссылке -> https://stepik.org/course/126074'
    color_msg = 0x5ACFF5

    return (title_msg, description_msg, color_msg)


def trainer_7_text() -> tuple[str, str, int]:
    title_msg = 'Курс-тренажёр по 7ому заданию ЕГЭ Информатика'

    description_msg = 'Отличная возможность по подготовке и тренировке 8ого задания из ЕГЭ.\n\n'
    description_msg += '• Научу с 0 делать этот номер;\n'
    description_msg += '• Разбор всех типов задания;\n'
    description_msg += '• 50+ заданий для практики;\n'
    description_msg += '• Задания из реальных ЕГЭ прошлых лет;\n'
    description_msg += '• Видео-разборы заданий;\n\n'
    description_msg += '• Ответы на все возникающие вопросы;\n\n'
    description_msg += 'Всего лишь за 350р. ты получишь всё это!\n'
    description_msg += 'Для приобретения курса перейди по ссылке -> https://stepik.org/a/131347'
    color_msg = 0x5ACFF5

    return (title_msg, description_msg, color_msg)


def trainer_8_text() -> tuple[str, str, int]:
    title_msg = 'Курс-тренажёр по 8ому заданию ЕГЭ Информатика'

    description_msg = 'Отличная возможность по подготовке и тренировке 8ого задания из ЕГЭ.\n\n'
    description_msg += '• Научу с 0 делать этот номер;\n'
    description_msg += '• 50+ заданий для практики;\n'
    description_msg += '• Задания из реальных ЕГЭ прошлых лет;\n'
    description_msg += '• Видео-разборы заданий;\n\n'
    description_msg += '• Ответы на все возникающие вопросы;\n\n'
    description_msg += 'Всего лишь за 350р. ты получишь всё это!\n'
    description_msg += 'Для приобретения курса перейди по ссылке -> https://stepik.org/a/131347'
    color_msg = 0x5ACFF5

    return (title_msg, description_msg, color_msg)


def trainer_15_text() -> tuple[str, str, int]:
    title_msg = 'Курс-тренажёр по 15ому заданию ЕГЭ Информатика'

    description_msg = 'Отличная возможность по подготовке и тренировке 15ого задания из ЕГЭ.\n\n'
    description_msg += '• Научу с 0 делать этот номер;\n'
    description_msg += '• 50+ заданий для практики;\n'
    description_msg += '• Задания из реальных ЕГЭ прошлых лет;\n'
    description_msg += '• Видео-разборы заданий;\n\n'
    description_msg += '• Ответы на все возникающие вопросы;\n\n'
    description_msg += 'Всего лишь за 350р. ты получишь всё это!\n'
    description_msg += 'Для приобретения курса перейди по ссылке -> https://stepik.org/149687'
    color_msg = 0x5ACFF5

    return (title_msg, description_msg, color_msg)


def promotion_ege_text(bot, owner) -> tuple[str, dict[str, str], int]:
    title_msg = 'Акции при прохождении курсов ЕГЭ'
    fields = dict()

    channel = find_channel_by_name(bot, 'о-курсах-егэ')
    fields['title_1'] = '1. Получить 30% скидку на любой курс + одну из кастомных ролей на выбор'
    field_msg_1 = 'Для этого тебе необходимо пройти бесплатный курс на степике "ЕГЭ Информатика 2023 | Курс-Тренажёр | Задание 2". '
    field_msg_1 += f'После прохождения курса, оставить отзыв и скинуть скрин мне ({owner.mention}) в качестве подтверждения. '
    field_msg_1 += f'Более подробная информация о курсе есть на канале {channel.mention}\n'
    field_msg_1 += 'Данная акция работает только 1 раз.'
    fields['field_1'] = field_msg_1

    fields['title_2'] = '2. Получить 100р. + одну из кастомных ролей на выбор'
    field_msg_2 = 'Для этого тебе необходимо пройти любой мой платный курс и оставить отзыв. '
    field_msg_2 += f'После этого необходимо скинуть скрин мне ({owner.mention}) в качестве подтверждения.\n'
    field_msg_2 += 'Данная акция работает работает для всех платных курсов.'
    fields['field_2'] = field_msg_2

    fields['title_3'] = '3. Приведи друга и получи до 50% от стоимости курса'
    field_msg_3 = 'Для этого другу необходимо при покупке курса указать твой ник в дискорде. '
    field_msg_3 += 'Процент зависит от курса и длительности (если это лайв курс). '
    field_msg_3 += f'За более подробной информацией ты можешь обратиться ко мне ({owner.mention}).\n'
    field_msg_3 += 'Данная акция работает работает бесконечное количество раз ;)'
    fields['field_3'] = field_msg_3

    fields['title_4'] = '4. Скидка до 30% на приобретение сразу несколько курсов'
    field_msg_4 = 'Взять сразу несколько курсов будет намного выгоднее, чем по отдельности их брать. '
    field_msg_4 += 'Чтобы узнать какие именно скидки будут и при каких курсах, то '
    field_msg_4 += f'пиши мне ({owner.mention}) за индивидуальным предложением.'
    fields['field_4'] = field_msg_4
    color_msg = 0x5ACFF5

    return (title_msg, fields, color_msg)


def monolith_text_1() -> tuple[str, str, int]:
    title_msg = 'Мастер-группа Монолит ЕГЭ Информатика'

    description_msg = 'Хочешь высокие баллы? Тогда это то, что тебе нужно!\n'
    description_msg += '80+, 90+ или 100 баллов станут реальностью 😉\n\n'
    description_msg += 'Монолит — это отличная возможность подготовиться к ЕГЭ!\n'
    description_msg += 'Совместно с ребятами, которые как и ты заинтересованы в успешной '
    description_msg += 'подготовке к экзамену, в приятной и комфортной атмосфере время '
    description_msg += 'пролетит быстро и ты получишь огромнейший ап скилла и уверенность в себе!\n\n'
    description_msg += 'Что входит в курс:\n\n'
    description_msg += '• 2 занятия в неделю. Все занятия записываются и у тебя  '
    description_msg += 'будет возможность пересмотреть их в любой момент.\n'
    description_msg += 'Длительность занятий ~90 минут.\n'
    description_msg += '• Много практики и нагоняи, которые помогут тебе '
    description_msg += 'не халтурить и выполнять дз ;)\n'
    description_msg += '• Регулярные пробники для наглядности твоего прогресса  '
    description_msg += 'и обретении уверенности в своих силах.\n'
    description_msg += '• Общий чат со мной, ребятами и куратором — это постоянная мотивация, '
    description_msg += 'обсуждение задач, помощь друг другу и немного фана, '
    description_msg += 'что позволит тебе всегда оставаться в тонусе.\n'
    description_msg += '• Общий чат со мной, ребятами и куратором — это постоянная мотивация, '
    description_msg += 'будет помогать и мотивировать тебя! ;) \n'
    description_msg += '• Бонусные занятия, созвоны для дополнительной практики и ответов на вопросы.\n'
    description_msg += '• Индивидуальная помощь при выборе ВУЗа и направлений.\n'
    description_msg += '• Длительность курса 4 месяца (ноябрь-декабрь-январь-февраль).\n\n'
    description_msg += '💰При оплате сразу за 4 месяцы ты получишь скидку + бонус ;) (подробнее пиши)\n'
    description_msg += '💻Как это проходит:\n'
    description_msg += 'Все занятия проходят на YouTube в виде закрытых стримов '
    description_msg += 'с использованием онлайн-доски (для хранения всех записей). '
    description_msg += 'Это означает, что у тебя всегда есть возможность пересмотреть '
    description_msg += 'занятие или зайти на доску и вспомнить, то что интересует.'

    color_msg = 0x5ACFF5

    return (title_msg, description_msg, color_msg)


def monolith_text_2(owner) -> tuple[str, str, int]:
    msg = 'Чтобы получить доступ к Мастер-группе нужно:\n'
    msg += '1. Перевести на карту сбербанка 1612р.  с текстом сообщения: "Монолит"\n'
    msg += '   номер карты: 4276 0800 1585 5878\n'
    msg += '2. Сделать скрин успешного перевода или скрин на последние 4 цифры карты\n'
    msg += '3. Email на YouTube, чтобы был доступ :)\n'
    msg += '4. Скинь мне свой ник в Discord, чтобы я дал роль на сервере\n\n'
    msg += f'Скрин и эмэйл отправь мне ({owner.mention}) в личные сообщения\n'
    msg += f'П.С. не забудь, что действует кэшбек и бонусная система, узнай об этом ;)'

    return msg
